# ContextualHelp Methods

---
The ContextualHelp type exposes the following members.
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Launch| Launches and displays the help topic specified by the contents of this ContextualHelp object.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
ContextualHelp Class
Autodesk.Revit.UI Namespace